; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-93)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b18)
    (on b18 b4)
    (on b4 b1)
    (on b1 b27)
    (on b27 b16)
    (on b16 b23)
    (on b23 b10)
    (on-table b10)
    (clear b5)
    (on b5 b13)
    (on-table b13)
    (clear b2)
    (on b2 b20)
    (on b20 b24)
    (on b24 b14)
    (on b14 b6)
    (on b6 b12)
    (on b12 b9)
    (on b9 b26)
    (on b26 b25)
    (on b25 b11)
    (on-table b11)
    (clear b3)
    (on-table b3)
    (clear b15)
    (on b15 b22)
    (on b22 b19)
    (on b19 b21)
    (on b21 b7)
    (on b7 b8)
    (on b8 b17)
    (on-table b17))
 (:goal (and 
(on-table b3) (on-table b17) (on-table b13)
(on b5 b4)
))
)

; plan
1. (unstack b18 b4)
   deleted: (on b18 b4) (clear b18) (arm-empty)
   added: (holding b18) (clear b4)
   goals met: 3 of 4
2. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 3 of 4
3. (unstack b5 b13)
   deleted: (on b5 b13) (clear b5) (arm-empty)
   added: (holding b5) (clear b13)
   goals met: 3 of 4
4. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 4 of 4
